ytwo/modules/controllers/MsgController.php

    public function  actionMsg(){
        $model=new Msg();
        $uid=Yii::$app->user->getId();
        $count=$model->find()->where(['tid'=>$uid])->count();
        $page=new Pagination(['defaultPageSize'=>5,'totalCount'=>$count]);
        $msgs=$model->find()->where(['tid'=>$uid])->orderBy('send_time asc')->orderBy('status asc')->offset($page->offset)->limit($page->limit)->all();
---
SELECT * FROM `yii_msg` WHERE `tid`=3 ORDER BY `send_time` DESC LIMIT 2 OFFSET 2
SELECT COUNT(*) FROM `yii_msg` WHERE `tid`=3

    public function  actionMysends(){
        echo  1111;exit;

        $model=new Msg();
        $uid=Yii::$app->user->getId();
        $count=$model->find()->where(['fid'=>$uid])->count();
        $page=new Pagination(['defaultPageSize'=>5,'totalCount'=>$count]);
        $msgs=$model->find()->where(['fid'=>$uid])->orderBy('send_time desc')->offset($page->offset)->limit($page->limit)->all();
---
SELECT COUNT(*) FROM `yii_msg` WHERE `fid`=3
SELECT * FROM `yii_msg` WHERE `fid`=3 ORDER BY `send_time` DESC LIMIT 5

    public function actionSendmsg(){

        //查找我关注的【满足条件才能发邮件】
        $uid=Yii::$app->user->getId();
        $follows=Follow::find()->where(['uid'=>$uid])->all();
---
SELECT * FROM `yii_follow` WHERE `uid`=3

    public function actionPull(){
        $arr=array();
        if(Yii::$app->request->isAjax){
            $num=Yii::$app->request->get('msgnum');
            //对比数据库当前用户未读消息结果
            $msgnum=Msg::find()->where(['tid'=>Yii::$app->user->getId()])->andWhere(['status'=>0])->count();
---
SELECT COUNT(*) FROM `yii_msg` WHERE (`tid`=1) AND (`status`=0)